{
    "version": "https://jsonfeed.org/version/1",
    "title": "kanthi.io",
    "description": "",
    "home_page_url": "https://kanthi.io",
    "feed_url": "https://kanthi.io/feed.json",
    "user_comment": "",
    "author": {
        "name": "Akshay Kanthi"
    },
    "items": [
        {
            "id": "https://kanthi.io/linked-data/",
            "url": "https://kanthi.io/linked-data/",
            "title": "Linked data",
            "summary": "TLDR: Organising things is easier in an excel sheet than a word document. The current web is a giant word document. How do we make it more excel like? Excel Word You remember the attendance registers in the 'Old School'. Everyday teachers in my school&hellip;",
            "content_html": "<p class=\"msg msg--highlight \"><strong>TLDR: <br></strong><br><strong>Organising things is easier in an excel sheet than a word document. The current web is a giant word document. How do we make it more <em>excel</em> like? </strong></p>\n<p><strong>Excel Word</strong><br><br>You remember the attendance registers in the 'Old School'. Everyday teachers in my school would have to 'mark' attendance of all students in the register. <br><br>Let's imagine for a moment that instead of 'marking' they 'logged' the attendance in good-ol e sentences. </p>\n<p>- Shreyas was present on 17 July 1999 Morning session<br>- Ashish was present on 17 July 1999 Morning session<br>- Shashi was present  on 17 July 1999 Afternoon session<br>...<br><br>Good luck counting and keeping tabs on the number of holidays taken by each student at the end of the month. <br><br>The good part is that no one takes attendance this way. We have specialised books with neatly laid out rows and columns, there were also times when teachers would hand-draw these grids for each date with a long ruler and red ink. Thanks to these organised grids, counting now would be a trivial and short exercise. There could be orders of magnitude of difference in time and effort needed to derive the same insights purely based on how we represent ideas and information. <br><br>What got unlocked when people transitioned from representing numbers from characters a.k.a Roman Numerals such as M, X, V, I to symbols such as 1000, 10, 5, 1? We then turned around to represent numbers with alphabet notations leading to the birth of algebra. <br><br>Did the representation of numbers on a line lead to the birth of calculus? </p>\n<p>One cannot overstate the importance on how we represent our ideas and knowledge. <br>Don't take my word for it. Here's the very popular quote from Einstein</p>\n<blockquote>\n<p><br>“We owe a lot to the Indians, who taught us how to count, without which no worthwhile scientific discovery could have been made.”<br>Albert Einstein</p>\n</blockquote>\n<p>How we represent ideas determines what we can do with them and what evolves from it. <br><br><strong>WORD Wide Web</strong><br><br>One of the reasons why people are spending countless hours doing 'research' online is because we are trying to glean structured data out of soupy text in a giant document consisting of billions of pages. <br><br>It's like the teacher from school running a query<br><br>\"Number of days Akshay was present this October\" only to get the search snippet</p>\n<p class=\"msg msg--highlight \"> \"Akshay was absent on Wednesday\"</p>\n<p>Which links to the full log of everyone's attendance. <br><br>While full prose style sentences are good for storytelling they aren't the best for capturing attendance and they definitely aren't the best tool for publishing all information on the web. </p>\n<p>In an ideal world when I'm looking for a coworking space in Bengaluru, what I want to see is a comprehensive list of coworking spaces with filters for prices, locations, and recommendations from friends. Instead we're drowning in a sea of listicles.</p>\n<figure class=\"post__image\"><img loading=\"lazy\"  src=\"https://kanthi.io/media/posts/20/Screenshot-2022-09-22-at-4.10.00-PM.png\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://kanthi.io/media/posts/20/responsive/Screenshot-2022-09-22-at-4.10.00-PM-xs.png 300w ,https://kanthi.io/media/posts/20/responsive/Screenshot-2022-09-22-at-4.10.00-PM-sm.png 480w ,https://kanthi.io/media/posts/20/responsive/Screenshot-2022-09-22-at-4.10.00-PM-md.png 768w ,https://kanthi.io/media/posts/20/responsive/Screenshot-2022-09-22-at-4.10.00-PM-lg.png 1024w ,https://kanthi.io/media/posts/20/responsive/Screenshot-2022-09-22-at-4.10.00-PM-xl.png 1360w ,https://kanthi.io/media/posts/20/responsive/Screenshot-2022-09-22-at-4.10.00-PM-2xl.png 1600w\"  alt=\"\" width=\"1844\" height=\"622\"></figure>\n<p>The diligent ones or interns will now create a spreadsheet and come up with this research, manually creating a Google Spreadsheet (or a Notion/Airtable if they're cooler) and finally pick the right one. <br><br>Here's another story to indicate the current problem of discoverability. In Apr 2021 I built a small tool that allows one to make twitter lists automatically. Apart from Reddit, Hackernews, Product hunt and my social media I didn't really share it anywhere else. I wish there was some sort of a global registry to list my tool as relevant for creating lists on twitter. <br><br></p>\n<figure class=\"post__image\" ><img loading=\"lazy\" src=\"https://kanthi.io/media/posts/20/Screenshot-2022-09-22-at-4.26.24-PM.png\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://kanthi.io/media/posts/20/responsive/Screenshot-2022-09-22-at-4.26.24-PM-xs.png 300w ,https://kanthi.io/media/posts/20/responsive/Screenshot-2022-09-22-at-4.26.24-PM-sm.png 480w ,https://kanthi.io/media/posts/20/responsive/Screenshot-2022-09-22-at-4.26.24-PM-md.png 768w ,https://kanthi.io/media/posts/20/responsive/Screenshot-2022-09-22-at-4.26.24-PM-lg.png 1024w ,https://kanthi.io/media/posts/20/responsive/Screenshot-2022-09-22-at-4.26.24-PM-xl.png 1360w ,https://kanthi.io/media/posts/20/responsive/Screenshot-2022-09-22-at-4.26.24-PM-2xl.png 1600w\"  alt=\"The ultra cool visualisation generated by my tool listtweet apart from creating lists automatically. \" width=\"2850\" height=\"1482\">\n<figcaption >The ultra cool visualisation generated by my tool ListTweet apart from creating lists automatically. </figcaption>\n</figure>\n<p>Almost 15 months after my launch of ListTweet I saw someone else on my Twitter discover that list creation on Twitter is broken. And lo and behold they were building an application to help address the problem. Interestingly I had given up hope that my application would ever be discovered and had even open sourced the product. </p>\n<figure class=\"post__image\" ><img loading=\"lazy\" src=\"https://kanthi.io/media/posts/20/Screenshot-2022-09-22-at-4.48.55-PM.png\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://kanthi.io/media/posts/20/responsive/Screenshot-2022-09-22-at-4.48.55-PM-xs.png 300w ,https://kanthi.io/media/posts/20/responsive/Screenshot-2022-09-22-at-4.48.55-PM-sm.png 480w ,https://kanthi.io/media/posts/20/responsive/Screenshot-2022-09-22-at-4.48.55-PM-md.png 768w ,https://kanthi.io/media/posts/20/responsive/Screenshot-2022-09-22-at-4.48.55-PM-lg.png 1024w ,https://kanthi.io/media/posts/20/responsive/Screenshot-2022-09-22-at-4.48.55-PM-xl.png 1360w ,https://kanthi.io/media/posts/20/responsive/Screenshot-2022-09-22-at-4.48.55-PM-2xl.png 1600w\"  alt=\"Shreyas discovering that making lists on twitter is a problem\" width=\"1204\" height=\"1438\">\n<figcaption >Shreyas discovering that making lists on twitter is a problemCaption</figcaption>\n</figure>\n<p><br>Why is it that someone is not able to discover prior work from their own twitter circle? What should exist for that to happen? How do we 'Google' who in the world has the same idea as mine?</p>\n<p class=\"msg msg--highlight \">Do we have an idea on how to represent any idea?!</p>\n<p>This question has been pondered by many including none other than the founder of the web Sir Tim Berners Lee who conceived the idea of the web of data a.k.a the Semantic Web. <br><br><strong>URLs? What do they mean?</strong></p>\n<p>As we have seen, a tabular grid is quite handy to structure information. We can use separate grids to track different types of information and connect things in one grid to another through links. (Foreign keys from the relational database world, linked records from the Airtable world)</p>\n<figure class=\"post__image\" ><img loading=\"lazy\" src=\"https://kanthi.io/media/posts/20/Screenshot-2022-09-23-at-11.42.09-AM.png\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://kanthi.io/media/posts/20/responsive/Screenshot-2022-09-23-at-11.42.09-AM-xs.png 300w ,https://kanthi.io/media/posts/20/responsive/Screenshot-2022-09-23-at-11.42.09-AM-sm.png 480w ,https://kanthi.io/media/posts/20/responsive/Screenshot-2022-09-23-at-11.42.09-AM-md.png 768w ,https://kanthi.io/media/posts/20/responsive/Screenshot-2022-09-23-at-11.42.09-AM-lg.png 1024w ,https://kanthi.io/media/posts/20/responsive/Screenshot-2022-09-23-at-11.42.09-AM-xl.png 1360w ,https://kanthi.io/media/posts/20/responsive/Screenshot-2022-09-23-at-11.42.09-AM-2xl.png 1600w\"  alt=\"rdbms data representation\" width=\"2374\" height=\"1262\">\n<figcaption >Data structured in tables. Credit: https://neo4j.com/developer/graph-db-vs-rdbms/</figcaption>\n</figure>\n<p>Another lens to view the tabular structure is the connected nodes (or graph) structure. <br><br></p>\n<figure class=\"post__image\" ><img loading=\"lazy\" src=\"https://kanthi.io/media/posts/20/Screenshot-2022-09-23-at-12.36.22-PM.png\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://kanthi.io/media/posts/20/responsive/Screenshot-2022-09-23-at-12.36.22-PM-xs.png 300w ,https://kanthi.io/media/posts/20/responsive/Screenshot-2022-09-23-at-12.36.22-PM-sm.png 480w ,https://kanthi.io/media/posts/20/responsive/Screenshot-2022-09-23-at-12.36.22-PM-md.png 768w ,https://kanthi.io/media/posts/20/responsive/Screenshot-2022-09-23-at-12.36.22-PM-lg.png 1024w ,https://kanthi.io/media/posts/20/responsive/Screenshot-2022-09-23-at-12.36.22-PM-xl.png 1360w ,https://kanthi.io/media/posts/20/responsive/Screenshot-2022-09-23-at-12.36.22-PM-2xl.png 1600w\"  alt=\"connected nodes\" width=\"2290\" height=\"1008\">\n<figcaption >Rows as Nodes. Credit: https://neo4j.com/developer/graph-db-vs-rdbms/</figcaption>\n</figure>\n<p>The advantage of the graph structure is the modelling flexibility and extensibility. We can arbitrarily connect each node to any other node via different types of relationships. This is the fundamental idea behind the semantic web. <br><br>The World Wide Web Consortium (W3C) has published standards to agree and interoperate on how to publish data structured as graphs on the open web. </p>\n<p>Despite being in development for more than 25 years the semantic web hasn't really taken off. <a href=\"https://terminusdb.com/blog/the-semantic-web-is-dead/\" target=\"_blank\" rel=\"noopener noreferrer\">Much</a> has been said about why the semantic web hasn't really taken off. At the heart of it  web applications that facilitate creating structured content on the internet have no incentives to share the hard collected data on the open web in an interoperable standard. Especially when the entire point of the business is to lock that data down and not share it at all costs. <br><br>But accessible organised knowledge about the world is paramount. We can even set a price to it. The asking rate is about <a href=\"https://www.diffbot.com/pricing/\" target=\"_blank\" rel=\"noopener noreferrer\">300$ for about 10,000 things</a>. <br><br>Another consequence of organised information not being accessible is the enormous cost of discoverability on the web. In 2022 for the first time ever world wide online ad spend is set to cross $600B.</p>\n<p>The extent of information organised in the world should be measured by the reduction in global ad spend. Global ad spend is a sort of tax for discovery. We need to find avenues of reducing this burden. My current thesis is that access to knowledge commons combined with the information of who has published the information and how we know them can help significantly in discoverability both from the perspective of people looking for answers and entities looking to be discovered. <br><br>The W3C approach of standards is on the assumption of self-publishing of data. But as a world we aren't there yet.  It's the same reason why we use gmail despite email being an open standard. We still continue to use Twitter despite there being ActivityPub. People aren't managing their own servers on their own terms. It's just easier to use centralised services and get the job done. The incentives are also aligned for organisations to build such centralised platforms. For now. </p>\n<p>Are there centralised platforms to organise all human knowledge? There are!</p>\n<p>One of the earliest projects in this space was <a href=\"https://en.wikipedia.org/wiki/Freebase_(database)\" target=\"_blank\" rel=\"noopener noreferrer\">freebase</a>.  Freebase got acquired by Google and was eventually shut down. Freebase at Google evolved to be the Google Knowledge Graph. The data and the crowdsourcing part of freebase currently exists as <a href=\"http://wikidata.org/\" target=\"_blank\" rel=\"noopener noreferrer\">wikidata</a>. </p>\n<p>The problem with Wikidata is the same as that on Wikipedia page. You and I aren't on it. Your dog doesn't have a wikipedia page (<a href=\"https://en.wikipedia.org/wiki/Royal_corgis\" target=\"_blank\" rel=\"noopener noreferrer\">unless you're the queen</a>) and would be taken down if you were to create one. The problem is that of <a href=\"https://en.wikipedia.org/wiki/Wikipedia:Notability\">notability</a>. </p>\n<p>We don't just need a knowledge base of notable things, we need one for everything. You should be able add yourself or your local grocery store to a public common database for everyone to use. </p>\n<p>There are other approaches where we structure information for certain verticals. For <a href=\"https://zomato.com/\" target=\"_blank\" rel=\"noopener noreferrer\">food</a>, <a href=\"https://magicpin.in/\" target=\"_blank\" rel=\"noopener noreferrer\">retail outlets</a>, <a href=\"https://tracxn.com/\" target=\"_blank\" rel=\"noopener noreferrer\">startups and investments</a>, <a href=\"https://alternativeto.net/\" target=\"_blank\" rel=\"noopener noreferrer\">saas products</a>. But each of these platforms is another silo. The data is neither part of the commons nor allows one to interlink to other things. <br><br>We need centralised platforms to structure all human knowledge and make it accessible. <br><br><a href=\"https://golden.com/\" target=\"_blank\" rel=\"noopener noreferrer\">Golden</a> seems to be pursuing this goal. They're also exploring incentivising contributions from everyone through <a href=\"https://golden.xyz\" target=\"_blank\" rel=\"noopener noreferrer\">tokens</a>. <br><br>Needless to say, this is a very exciting space for me. Last month I started working on a proof of concept (<a href=\"https://crowww.in\" target=\"_blank\" rel=\"noopener noreferrer\">https://crowww.in</a>) for a crowdsourced knowledge graph. <br><br>As a starting point I've indexed the 'Ecological Wealth' database curated by Ganeshram from Rainmatter Foundation. You can currently look up 37k+ entities and 140,000+ relationships.</p>\n<p>You can also view the entire data <a href=\"https://ecologicalwealth.in\" target=\"_blank\" rel=\"noopener noreferrer\">on this massive Airtable base</a>. <br><br>Would love to hear your thoughts on this!</p>\n<blockquote>\n<p>“Eventually everything connects - people, ideas, objects. <br>The quality of the connections is the key to quality per se.\"<br>Charles Eames</p>\n</blockquote>\n<p> </p>",
            "image": "https://kanthi.io/media/posts/20/DALLE-2022-09-23-13.55.26-We-are-all-interconnected-in-a-web-of-networks-and-systems-like-roots-cyber-punk-style.png",
            "author": {
                "name": "Akshay Kanthi"
            },
            "tags": [
                   "semantic web",
                   "linked-data",
                   "knowledge graphs",
                   "golden.com",
                   "diffbot"
            ],
            "date_published": "2022-09-21T16:48:35+05:30",
            "date_modified": "2022-09-23T14:18:43+05:30"
        },
        {
            "id": "https://kanthi.io/tech-by-the-lake/",
            "url": "https://kanthi.io/tech-by-the-lake/",
            "title": "Tech by the lake",
            "summary": "It's such a relief to start writing a blog post when the person nudging you towards writing it has asked you not to spend more than an hour and has assured that no-one is going to read it. Thanks Lobo for that assurance. Phew! 🤧&hellip;",
            "content_html": "<p>It's such a relief to start writing a blog post when the person nudging you towards writing it has asked you not to spend more than an hour and has assured that no-one is going to read it. Thanks <a href=\"https://www.linkedin.com/in/donald-lobo/\" target=\"_blank\" rel=\"noopener noreferrer\">Lobo</a> for that assurance. Phew! 🤧<br><br>Social Impact Sprint is an initiative lead by the <a href=\"https://chintugudiya.org/blog/announcing-the-social-impact-sprint-tehri-nov-14-21/\" target=\"_blank\" rel=\"noopener noreferrer\">Tech4Dev consortium</a>. The objective was to get people who work on the tech side of the social impact space together (Yes, there's that side) and get them to talk to each other before they start building another <code>form builder</code>. <br>For an excellent summary of what happened please check out Aman's (from Plio) <a href=\"https://plio.substack.com/p/a-sprint-from-the-hills\" target=\"_blank\" rel=\"noopener noreferrer\">post</a>. <br><br>Here are some of my own learnings and reflections on the week that was!<br><br><strong>Do it in the Mountains</strong><strong> </strong></p>\n<figure class=\"post__image post__image--center\" ><img loading=\"lazy\" style=\"font-size: 17.7235px; outline: 3px solid rgba(var(--primary-color-rgb), 0.55)  !important;\" src=\"https://kanthi.io/media/posts/19/IMG_20211115_092745.jpeg\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://kanthi.io/media/posts/19/responsive/IMG_20211115_092745-xs.jpeg 300w ,https://kanthi.io/media/posts/19/responsive/IMG_20211115_092745-sm.jpeg 480w ,https://kanthi.io/media/posts/19/responsive/IMG_20211115_092745-md.jpeg 768w ,https://kanthi.io/media/posts/19/responsive/IMG_20211115_092745-lg.jpeg 1024w ,https://kanthi.io/media/posts/19/responsive/IMG_20211115_092745-xl.jpeg 1360w ,https://kanthi.io/media/posts/19/responsive/IMG_20211115_092745-2xl.jpeg 1600w\"  alt=\"\" width=\"3840\" height=\"2160\">\n<figcaption >No, this isn't from Unsplash. I took this one.</figcaption>\n</figure>\n<p>I've got to admit, when I received the email from Lobo inviting me, I decided I wanted to go  because it was happening in Tehri. You mean I get to stay in Uttarakhand for a week doing something remotely connected to tech? One for me please. I'm so glad that we could do this from the Mountains. They've still got the charm where a lady will stop a hiking group, walk up to her Gauva tree and pluck 30 guavas to keep us company for the hike. Thank you Tehri!<br><br><strong>Eat strategy for Breakfast<br></strong>The team at <a href=\"https://coloredcow.com\" target=\"_blank\" rel=\"noopener noreferrer\">ColoredCow</a> are the most gracious and giving hosts. I perhaps learnt the most observing how they function. Their biggest achievement is that they've got a happy, enthusiastic team that gives it all. It was great to witness people genuinely excited about their role. They've managed to build young leaders so much you'd not know who their founder/CEO is despite being in the same room. Congratulations team! You're an inspiration. Their initiative of <a href=\"https://storyclub.coloredcow.com/\" target=\"_blank\" rel=\"noopener noreferrer\">weekly story sharing</a> was a major highlight. I hope this becomes a norm at all organisations. A safe space for expression, being vulnerable and connecting with each other. They've managed to do all this while sporting suits, getting paid to do open source and brewing coffee with beakers that can put a COVID testing lab to shame. Wow.</p>\n<figure class=\"post__image\" ><img loading=\"lazy\" src=\"https://kanthi.io/media/posts/19/IMG_20211115_163546-3.jpeg\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://kanthi.io/media/posts/19/responsive/IMG_20211115_163546-3-xs.jpeg 300w ,https://kanthi.io/media/posts/19/responsive/IMG_20211115_163546-3-sm.jpeg 480w ,https://kanthi.io/media/posts/19/responsive/IMG_20211115_163546-3-md.jpeg 768w ,https://kanthi.io/media/posts/19/responsive/IMG_20211115_163546-3-lg.jpeg 1024w ,https://kanthi.io/media/posts/19/responsive/IMG_20211115_163546-3-xl.jpeg 1360w ,https://kanthi.io/media/posts/19/responsive/IMG_20211115_163546-3-2xl.jpeg 1600w\"  alt=\"Tushar brewing\" width=\"2160\" height=\"2825\">\n<figcaption >Tushar - Brewing in his lab</figcaption>\n</figure>\n<p><strong>Empty space for connections<br></strong>Thanks to my time at <a href=\"https://www.geekskool.com/\" target=\"_blank\" rel=\"noopener noreferrer\">GeekSkool</a> I've done a bit of volunteering at <a href=\"https://hasgeek.com/\" target=\"_blank\" rel=\"noopener noreferrer\">tech conferences</a>. While the idea behind conferences is for people to connect there's hardly any space-time for that. With only one <em>tech-talk</em> in the morning and a <em>deep-dive</em> for the evening there was plenty of time to connect and also continue to work. The hikes and having all meals together helped. Not to forget the Coloredcow team diligently hosting drinks every single night. So less talks and more empty space for connections worked wonders. During these times I loved ranting about all things related to grant making and measuring impact with Lobo or learning about what difference documentation can make in everyday product development from <a href=\"https://www.ooloilabs.in/\" target=\"_blank\" rel=\"noopener noreferrer\">Shen</a>. <br><br><strong>Govt run enterprises are weird<br></strong>We were given the very best spots for stay in all of Tehri. <a href=\"https://gmvnonline.com/Accommodation_Book_New?acc=80\" target=\"_blank\" rel=\"noopener noreferrer\">The Eco-huts</a> and the THDC guest house. Interestingly both these spaces are managed by govt enterprises. Despite having access to some of the best infrastructure there's an eery coldness on how the whole thing is managed and run. The whole experience was a very clear indicator for why government should stay out of running a business. The incentives and the motivation just don't match up. </p>\n<p><strong>Top engineering talent looking at Social Impact<br></strong>Inspiring to see engineers from some of the top engineering colleges in India actively looking for work in the social impact space. Met grads from BITS Pilani and IIT Guwahati. They have been carefully looking at what type of roles they would like to choose and what kind of impact it leads to. Fantastic. 🙌<br><br><strong>Pragmatic open-source<br></strong>The Tech4Dev team which is behind the <a href=\"https://glific.org/\" target=\"_blank\" rel=\"noopener noreferrer\">Glific</a> platform has a relentless focus on being useful for the real-world. Glific is a fantastic example of pragmatic software where the product combines the idealism of grant supported open-source, social impact with practicality of WhatsApp, Google Big Query and Data Studio. Idealistic realism concoction. </p>\n<p><strong>Wishlist for the next sprint<br></strong>Thank you once again Lobo and the Coloredcow team for making this happen. Here's my small wish-list for the next sprint. </p>\n<ul>\n<li> We should also bring board games</li>\n<li> Hackathon nights to build and demo something</li>\n</ul>\n<p><strong>All offices should have at least one neon logo</strong></p>\n<figure class=\"post__image\" ><img loading=\"lazy\" src=\"https://kanthi.io/media/posts/19/IMG_20211114_211820_LL.jpeg\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://kanthi.io/media/posts/19/responsive/IMG_20211114_211820_LL-xs.jpeg 300w ,https://kanthi.io/media/posts/19/responsive/IMG_20211114_211820_LL-sm.jpeg 480w ,https://kanthi.io/media/posts/19/responsive/IMG_20211114_211820_LL-md.jpeg 768w ,https://kanthi.io/media/posts/19/responsive/IMG_20211114_211820_LL-lg.jpeg 1024w ,https://kanthi.io/media/posts/19/responsive/IMG_20211114_211820_LL-xl.jpeg 1360w ,https://kanthi.io/media/posts/19/responsive/IMG_20211114_211820_LL-2xl.jpeg 1600w\"  alt=\"Coloredcow\" width=\"3840\" height=\"2160\">\n<figcaption >Coloredcow</figcaption>\n</figure>\n<p> </p>",
            "image": "https://kanthi.io/media/posts/19/IMG_20211120_070135.jpeg",
            "author": {
                "name": "Akshay Kanthi"
            },
            "tags": [
            ],
            "date_published": "2021-11-24T14:05:00+05:30",
            "date_modified": "2022-09-23T14:19:07+05:30"
        },
        {
            "id": "https://kanthi.io/madeva-deva-mahadeva-lyrics/",
            "url": "https://kanthi.io/madeva-deva-mahadeva-lyrics/",
            "title": "Madeva Deva Mahadeva Lyrics",
            "summary": "This song was part of Isha Mahashivarathri 2021 celebrations Lyrics: Girish Jamadagni Maarudda Jadeyavage Jagavudda Haneyavage Gangeyya Katitta Shikeyolage Gangeyya Katitta Shikeyolage Tangyavva Palakuva Maiyya Mailarege Huliya Charmada Hodike Naagarajane Haara Hattu Bhujadavanu Aa Dheera Hattu Bhujadavanu Aa Dheera Namagella Abhayavannu Koduvanu Mallesha O Madeva&hellip;",
            "content_html": "<p>This song was part of Isha Mahashivarathri 2021 celebrations<br><br>Lyrics: <a href=\"https://www.youtube.com/channel/UCPqo6ugayVoAE5N8h0d635Q\">Girish Jamadagni</a></p>\n<div class=\"post__iframe\"><iframe loading=\"lazy\" width=\"560\" height=\"315\" src=\"https://www.youtube-nocookie.com/embed/PyMG6PU_y7I\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"allowfullscreen\"></iframe></div>\n<p>Maarudda Jadeyavage Jagavudda Haneyavage<br>Gangeyya Katitta Shikeyolage<br>Gangeyya Katitta Shikeyolage Tangyavva<br>Palakuva Maiyya Mailarege<br>Huliya Charmada Hodike<br>Naagarajane Haara<br>Hattu Bhujadavanu Aa Dheera<br>Hattu Bhujadavanu Aa Dheera<br>Namagella Abhayavannu Koduvanu Mallesha<br><br>O Madeva Deva Madeva Deva Madeva Deva Mahadeva <br>Madeva Deva Madeva Deva Madeva Deva Mahadeva <br>Madeva Deva Mahadeva <br>Madeva Deva Mahadeva <br>Madeva Deva Mahadeva Deva<br>Madeva Deva Mahadeva <br><br>Dangurake Kuniyonu<br>Manjanake Maniyonu<br>Hannondu Roopa Padedonu<br>Hannondu Roopa Padedonu Aaharanu<br>Ondondu Paapavannu Mannipanu<br>Shiddanendu Avane Shuddanaadavanu Avane<br>Shambhu Chimdambaranu Avanene<br>Shambhu Chimdambaranu Avanene Lokadi<br>Noorentu Hesaruntu Kaapalige<br><br>O Madeva Deva Madeva Deva Madeva Deva Mahadeva <br>Madeva Deva Madeva Deva Madeva Deva Mahadeva <br>Madeva Deva Mahadeva <br>Madeva Deva Mahadeva <br>Madeva Deva Mahadeva Deva<br>Madeva Deva Mahadeva <br><br>Malligeya Maibanna Kadagappu Koraluvanu<br>Moormooneya Aayudhava Hididavanu<br>Moormooneya Aayudhava Hididavanu<br>Murudanu Hadinaalku Lokavannu Salaguvanu<br>Bhuyallu Aashivanu Bhavadallu Aashivanu<br>Nannallu Ninnallu Aashivanu<br>Nannallu Ninnallu Aashivanu Tilidvana <br>Kaihididu Nadiyonu Jagadishanu<br><br>O Madeva Deva Madeva Deva Madeva Deva Mahadeva <br>Madeva Deva Madeva Deva Madeva Deva Mahadeva <br>Madeva Deva Mahadeva <br>Madeva Deva Mahadeva <br>Madeva Deva Mahadeva Deva<br>Madeva Deva Mahadeva <br><br>ಮಾರುದ್ದ ಜಡೆ  ಅವಗೆ<br>ಜಗವುದ್ದ ಹಣೆಯವಗೆ <br>ಗಂಗೆಯ ಕಟ್ಟಿಟ್ಟ ಶಿಖೆಯೊಳಗೆ<br>ಗಂಗೆಯ ಕಟ್ಟಿಟ್ಟ ಶಿಖೆಯೊಳಗೆ<br>ತಂಗ್ಯವ್ವ  ಪಳಕುವ ಮೈಯಿ ಮೈಲಾರಿಗೆ<br>ಹುಲಿಯ ಚರ್ಮದ ಹೊದಿಕೆ<br>ನಾಗರಾಜನೇ ಹಾರ <br>ಹತ್ತು ಭುಜದವನು ಆ ಧೀರ<br>ಹತ್ತು ಭುಜದವನು ಆ ಧೀರ<br>ನಮಗೆಲ್ಲ ಅಭಯವನೇ ಕೊಡುವಾನು ಮಲ್ಲೇಶ <br><br>ಒ ಮಾದೇವ ದೇವ ಮಾದೇವ ದೇವ ಮಾದೇವ ದೇವ ಮಹಾದೇವ<br>ಮಾದೇವ ದೇವ ಮಾದೇವ ದೇವ ಮಾದೇವ ದೇವ ಮಹಾದೇವ<br>ಮಾದೇವ ದೇವ ಮಹಾದೇವ<br>ಮಾದೇವ ದೇವ ಮಹಾದೇವ<br>ಮಾದೇವ ದೇವ ಮಹಾದೇವ ದೇವ <br>ಮಾದೇವ ದೇವ ಮಹಾದೇವ<br><br>ಡಂಗುರಕೆ ಕುಣಿಯೋನು<br>ಮಂಜನಕೆ ಮಣಿಯೋನು<br>ಹನ್ನೊಂದು ರೂಪ ಪಡೆದೋನು<br>ಹನ್ನೊಂದು ರೂಪ ಪಡೆದೋನುಆ ಹರನು<br>ಒಂದೊಂದು ಪಾಪವನು ಮನ್ನಿಪನು<br>ಸಿದ್ಧನೆಂದರು ಅವನೇ<br>ಶುದ್ಧನಾದವನು ಅವನೇ<br>ಶಂಭು ಚಿದಂಬರನೂ ಅವನೇನೆ<br>ಶಂಭು ಚಿದಂಬರನೂ ಅವನೇನೆ <br>ಲೋಕದಿ  ನೂರೆಂಟು ಹೆಸರುಂಟು ಕಾಪಾಲಿಗೆ</p>\n<p>ಒ ಮಾದೇವ ದೇವ ಮಾದೇವ ದೇವ ಮಾದೇವ ದೇವ ಮಹಾದೇವ<br>ಮಾದೇವ ದೇವ ಮಾದೇವ ದೇವ ಮಾದೇವ ದೇವ ಮಹಾದೇವ<br>ಮಾದೇವ ದೇವ ಮಹಾದೇವ<br>ಮಾದೇವ ದೇವ ಮಹಾದೇವ<br>ಮಾದೇವ ದೇವ ಮಹಾದೇವ ದೇವ <br>ಮಾದೇವ ದೇವ ಮಹಾದೇವ<br><br>ಮಲ್ಲಿಗೆಯ ಮೈಬಣ್ಣ<br>ಕಡುಗಪ್ಪು ಕೊರಳವನು <br>ಮೂರ್ಮೊನೆಯ ಆಯುಧವ ಹಿಡಿದವನು <br>ಮೂರ್ಮೊನೆಯ ಆಯುಧವ ಹಿಡಿದವನು <br>ಮುರುಡನು ಹದಿನಾಲ್ಕು ಲೋಕವನು ಸಲಹುವನು<br>ಭುವಿಯಲ್ಲೂ ಆ ಶಿವನು<br>ಭವದಲ್ಲೂ ಆ ಶಿವನು  <br>ನನ್ನಲ್ಲೂ ನಿನ್ನಲ್ಲೂ ಆ ಶಿವನು<br>ನನ್ನಲ್ಲೂ ನಿನ್ನಲ್ಲೂ ಆ ಶಿವನು ತಿಳಿದವನ<br>ಕೈ ಹಿಡಿದು ನಡೆಸಾನು ಜಗದೀಶನು<br><br>ಒ ಮಾದೇವ ದೇವ ಮಾದೇವ ದೇವ ಮಾದೇವ ದೇವ ಮಹಾದೇವ<br>ಮಾದೇವ ದೇವ ಮಾದೇವ ದೇವ ಮಾದೇವ ದೇವ ಮಹಾದೇವ<br>ಮಾದೇವ ದೇವ ಮಹಾದೇವ<br>ಮಾದೇವ ದೇವ ಮಹಾದೇವ<br>ಮಾದೇವ ದೇವ ಮಹಾದೇವ ದೇವ <br>ಮಾದೇವ ದೇವ ಮಹಾದೇವ</p>",
            "author": {
                "name": "Akshay Kanthi"
            },
            "tags": [
            ],
            "date_published": "2021-07-04T09:10:03+05:30",
            "date_modified": "2021-07-04T09:37:11+05:30"
        },
        {
            "id": "https://kanthi.io/making-computers-personal-again/",
            "url": "https://kanthi.io/making-computers-personal-again/",
            "title": "Making Computers Personal Again",
            "summary": "The computer stopped being personal. Most of the apps I use on my computer today is on the browser. The data I create and view just rests somewhere else. It's anything but personal. Even development is moving to the cloud with @replit and @glitch What's&hellip;",
            "content_html": "<p>The computer stopped being personal. Most of the apps I use on my computer today is on the browser. The data I create and view just rests somewhere else. It's anything but personal. Even development is moving to the cloud with @replit and @glitch<br><br>What's the problem? Data silo-isation, lack of insight into your own data, privacy...<br><br>The only way out is for everyone to have a personal computer on the cloud. This computer manages all identity, data and communication with the world. <br><br>Everyone already has a personal @Dropbox or @googledrive i.e storage. But just storage isn't a computer. We need to bring processing and RAM to everyone. <br>This will not only empower individuals to own all their data and bring privacy but also finally free up developers from the whole dev-ops saga. Not kubernetes or even render. This is truly going serverless for the developer. Developers can focus on building experiences/views over data. What are the features that this personal computer need to have? <br><br>Open source<br>Permissive license<br>Shared Database across apps (perhaps using @SolidMit + @GraphQL )<br>Web server<br>Task Runner / Queue<br>Automator like Zapier <br>Cron<br>Functions <br>Who's already working on this? <br>@urbit @SandstormIO @cozycloud https://protos.io @inrupt <br><br><br>@urbit : A completely different universe with it's own stars. https://urbit.org/docs/glossary/star/ Complete with it's own OS, Networking protocol. Seems to have the steepest learning curve for developer adoption. <br><br>@SandstormIO : A project perhaps ahead of it's time.  Crowdfunded on @Indiegogo by the visionary @KentonVarda back in 2014. The project moved to being community run in 2017. They support one click installations of @gitlab @RocketChat. That said it looks like @SandstormIO needs more dev support, adoption and most importantly funds. <br><br>@cozycloud : \"Built in France not in California\". Featured open source apps, built in-house. A password manager, a Google Drive alternative, A notes app, and an app to manage bank accounts. The platform is open source and can be self hosted. Free for upto 5GB. @cozycloud Could do with more developer adoption. Impressive project all. <br><br>protos.io: Very early stage and seems to be using a docker centric approach for applications. According to them they're in \"dire needs of extra development hands\".<br><br>Overall both as an end user as well as well as a developer I would love to see some consolidation here. This will help drive more developers and in turn end users. Monopolies aren't all that bad? <br><br>I wonder if @GraphQL centric personal cloud computer can be built. It already has a ton of developer adoption, a foundation driving standard. Porting existing apps should be relatively easy. @HasuraHQ are you listening? <br><br>The space is still quite new. I believe has the potential to change SaaS as we know today and can make data ownership and privacy default and by design. <br><br>Who's positioned to be successful and can get into this space? <br>No-code platforms, cloud companies. So @airtable @Firebase @awscloud @Azure @HasuraHQ @render @heroku <br><br></p>",
            "author": {
                "name": "Akshay Kanthi"
            },
            "tags": [
            ],
            "date_published": "2021-03-23T04:56:15+05:30",
            "date_modified": "2021-03-23T04:58:36+05:30"
        },
        {
            "id": "https://kanthi.io/data-commons/",
            "url": "https://kanthi.io/data-commons/",
            "title": "Data Commons",
            "summary": "You look up a place or a commute on Google Maps. After a couple hours Google casually informs you that the place has an average review of 4 and that if you agree with that rating. It's right there in the notification. You don't even&hellip;",
            "content_html": "<p><span style=\"font-weight: 400;\">You look up a place or a commute on Google Maps. After a couple hours Google casually informs you that the place has an average review of 4 and that if you agree with that rating. It's right there in the notification. You don't even have to switch to the app. You don't have to think about what rating you want to assign to this place. Yes? No? </span></p>\n<p><span style=\"font-weight: 400;\">All points to Google for making it this seamless. Maybe you agree with the question. The place was indeed worth 4 stars. And just like that Google just got some work done. From you. For free.</span></p>\n<p><span style=\"font-weight: 400;\">Of course they do offer a very valuable service. This piece of information that you've just shared would be very useful, just how the rating of the place was useful to you before you got there. </span><span style=\"font-weight: 400;\"><br></span><span style=\"font-weight: 400;\"><br></span><span style=\"font-weight: 400;\">My only concern is that this very valuable data gets locked up. I wish all of this crowdsourced data belonged to the commons. See when I publicly share a review I do want to share this piece of information with the world. Yes, Google may use that information too. But I also want it to be open. To add to the collective knowledge base. And if this information is useful for someone other than Google, they should be able to leverage this to perhaps build an alternative or a better service. Unfortunately, today many internet platforms gather structured valuable information and lock it in. </span><span style=\"font-weight: 400;\"><br></span><span style=\"font-weight: 400;\"><br></span><span style=\"font-weight: 400;\">All this while adding it to their terms that you give them and their affiliates a royalty free worldwide license to share this information. I think platforms should mature enough where all crowd sourced information is available under an open license and easily available for download and to be built on top of. Stackoverflow already does this. Wikipedia/Wikidata is a stellar example. </span><span style=\"font-weight: 400;\"><br></span><span style=\"font-weight: 400;\"><br></span><strong>What’s the way out? <br></strong><span style=\"font-weight: 400;\"><br></span><span style=\"font-weight: 400;\">We should build easy to use software that allows people to create knowledge day in and day out. Like Google, FB, Instagram, Twitter already do. Only this time we have a way for people to retain ownership of all this data first. Then allow them to share this with whomsoever they wish to. Just friends or the whole world. Let them decide. That’s what allows standing over the shoulders of giants. That’s what drives innovation. The </span><a href=\"https://inrupt.com/solid\"><span style=\"font-weight: 400;\">solid</span></a><span style=\"font-weight: 400;\"> project from </span><a href=\"https://inrupt.com/\"><span style=\"font-weight: 400;\">inrupt</span></a><span style=\"font-weight: 400;\"> is a fine step in this direction. </span><span style=\"font-weight: 400;\"><br></span><span style=\"font-weight: 400;\"><br></span><span style=\"font-weight: 400;\">Let’s reinstate the commons. Shall we? </span></p>",
            "image": "https://kanthi.io/media/posts/13/ruben-bagues-_DkmMhzrsYY-unsplash.jpg",
            "author": {
                "name": "Akshay Kanthi"
            },
            "tags": [
            ],
            "date_published": "2021-01-08T02:21:11+05:30",
            "date_modified": "2022-07-12T10:02:07+05:30"
        },
        {
            "id": "https://kanthi.io/getting-started-with-customer-support-on-telegram/",
            "url": "https://kanthi.io/getting-started-with-customer-support-on-telegram/",
            "title": "Getting started with Customer Support on Telegram",
            "summary": "For any business customer support and addressing queries is absolutely essential. While large businesses have elaborate CRM (Customer Relationship Management) systems, small business owners generally need something much more simple. Today we can already see businesses using WhatsApp extensively to interact and engage with their&hellip;",
            "content_html": "<p>For any business customer support and addressing queries is absolutely essential. While large businesses have elaborate CRM (Customer Relationship Management) systems, small business owners generally need something much more simple.</p>\n<p>Today we can already see businesses using WhatsApp extensively to interact and engage with their customers with their WhatsApp Business account.</p>\n<p>While WhatsApp Business account works great for addressing customer queries there are a few caveats.</p>\n<ul>\n<li>Restricted API access. (WhatsApp business API is currently available only for medium and large businesses only)</li>\n<li>Need to have a separate phone number for your business.</li>\n<li>Restrictions on the number of users you can broadcast your message. (Currently 256)</li>\n</ul>\n<p>To navigate around some of these restrictions businesses can leverage another popular messaging platform Telegram. Let's see how Telegram addresses some of the above concerns.</p>\n<ul>\n<li>Open API access.</li>\n<li>You can create a Bot account for your business without having to have a separate phone number.</li>\n<li>No limits on number of contacts or messages. (Has a generous rate limit of 30 messages / second)</li>\n</ul>\n<h3>How to start engaging your customers on Telegram.</h3>\n<h4>Create separate Telegram business identity</h4>\n<p>There are two types of accounts on Telegram.</p>\n<ul>\n<li>User account</li>\n<li>Bot account</li>\n</ul>\n<p>If you want to get a user account you need to have a separate phone number. We recommend creating a Bot account instead. Some advantages for why a Bot account makes more sense for businesses.</p>\n<ul>\n<li>Independent Business identity, not tied to a phone number.</li>\n<li>Easy to integrate self-service features for customers</li>\n<li>Easy API for broadcast messages.</li>\n<li>Seamlessly move to a full fledged CRM while retaining the same Telegram Business identity.</li>\n</ul>\n<p>How to create a Telegram Bot?</p>\n<p>Yes, there's a bot for that. Please follow the instructions given here. <a href=\"https://core.telegram.org/bots#3-how-do-i-create-a-bot\">https://core.telegram.org/bots#3-how-do-i-create-a-bot</a></p>\n<h4>Managing your Bot with Telebooth</h4>\n<p>While it's very easy to create a new Telegram Bot identity, managing the same is far from trivial. Generally businesses connect the Telegram Bot token with a CRM such as <a href=\"http://respond.io\">respond.io</a>, freshchat etc to start managing 1-1 conversations reaching out to the Bot.</p>\n<p>If you're looking for a simpler self-managed solution you can consider using <a href=\"https://telebooth.kanthi.io\" target=\"_blank\" rel=\"noopener noreferrer\">Telebooth</a> to manage your Telegram Bot. It's free and open source software with no restrictions on usage.</p>\n<p>Please follow the setup instructions here: <a href=\"https://telebooth.kanthi.io/docs/index\">https://telebooth.kanthi.io/docs/index</a></p>\n<h4>Publish your Telegram ID on your website</h4>\n<p>Now that you've connected your Telegram account to Telebooth you're ready to start receiving messages. Go ahead and publish your Telegram Bot details on the website. Your id will look something like <code>https://t.me/businessNameBot</code></p>\n<h4>Start chatting</h4>\n<p>Once you have connected your Telegram Business account to Telebooth you should have a familiar web interface to start chatting with all customers.</p>\n<p>If you need any assistance in setting up Telebooth or need a managed service, please write to <a href=\"mailto:akshay@kanthi.io\">akshay@kanthi.io</a></p>",
            "image": "https://kanthi.io/media/posts/12/christian-wiediger-GWkioAj5aB4-unsplash.jpg",
            "author": {
                "name": "Akshay Kanthi"
            },
            "tags": [
                   "telegram",
                   "crm",
                   "bot"
            ],
            "date_published": "2021-01-05T14:52:07+05:30",
            "date_modified": "2021-01-05T15:09:49+05:30"
        },
        {
            "id": "https://kanthi.io/telebooth/",
            "url": "https://kanthi.io/telebooth/",
            "title": "Telebooth",
            "summary": "At MountBlue we process a few thousand candidates who have applied to our Software Engineer trainee position. Our process involves 6-7 communication steps Needless to say that all the above communication between the organisation and the candidate is extremely important for both the parties. Currently&hellip;",
            "content_html": "<p>At <a href=\"#INTERNAL_LINK#/post/null\" title=\"https://mountblue.io\">MountBlue</a> we process a few thousand candidates who have applied to our Software Engineer trainee position. Our process involves 6-7 communication steps</p>\n<ul>\n<li>Send Candidate acknowledgement email as soon as the candidate applies to the position.</li>\n<li>Send invite to home test</li>\n<li>Send reminder to home test</li>\n<li>Send home test result</li>\n<li>Send invite to live interview</li>\n<li>Send live interview reminder</li>\n<li>Send result of live interview</li>\n<li>Send offer letter</li>\n<li>Send joining date</li>\n</ul>\n<p>Needless to say that all the above communication between the organisation and the candidate is extremely important for both the parties. Currently all the above important notifications are sent via email. But emails may get ignored because of the sheer volume and email landing up in <code>Updates</code> / <code>Promotions</code> section of Gmail. Ideally we'd want to send all these important notifications via a messaging platform such as <code>WhatsApp</code> or <code>Telegram</code>.</p>\n<p>As far as I know there is no straight forward way to get API access on WhatsApp. There's a way out though. Telegram. In my understanding the quickest way to create a separate identity for your business and send messages programmatically on Telegram is via the Telegram Bot API.</p>\n<p>Great. We use Airtable as our ATS. So I wrote an Airtable script to send messages using our Telegram Bot. Problem solved? Except that once the candidate receive the message they would also want to respond back with questions / confirmations. For that a Telegram Web interface would have been really convenient.</p>\n<p>Is there a Telegram Web interface that you can connect with your Bot and hold both 1-1 conversations as well as send programmatic messages?</p>\n<p>Welcome <a href=\"https://telebooth.kanthi.io\">Telebooth</a>. Telebooth is a simple web interface similar to WhatsApp Web or Telegram web that you can connect with your Telegram Bot and hold both 1-1 messages with all your stakeholders as well as send messages in bulk. It might be particularly relevant for businesses / individuals who still don't want a full fledged CRM and can do with a simple web interface with 1-2 people in the organisation managing all communication.</p>\n<p>What's more Telebooth is <a href=\"https://github.com/aksanoble/telebooth\">free and open-source</a>. Self host and use it with no restrictions on the number of messages or users.</p>\n<p>Is this relevant to you? Do you have any questions or feedback? Please let me know.</p>",
            "image": "https://kanthi.io/media/posts/11/telebooth.png",
            "author": {
                "name": "Akshay Kanthi"
            },
            "tags": [
            ],
            "date_published": "2021-01-02T15:09:54+05:30",
            "date_modified": "2021-01-02T15:10:22+05:30"
        },
        {
            "id": "https://kanthi.io/her-majesty/",
            "url": "https://kanthi.io/her-majesty/",
            "title": "her majesty",
            "summary": "back in your arms mother my heart skips a beat as if to take a pause and inhale you fully once and for all as mind races to admire you with its limited vocabulary sssshh... ssshhh i'm silenced by your majesty leaving nothing but an&hellip;",
            "content_html": "back in your arms<br>mother<br>my heart skips <br>a beat as if<br>to take a pause <br>and inhale you fully<br>once and for all<br>as mind races<br>to admire you <br>with its limited <br>vocabulary<br>sssshh... ssshhh<br>i'm silenced<br>by your majesty<br>leaving nothing<br>but an endless<br>dumbstruck gaze",
            "image": "https://kanthi.io/media/posts/9/IMG_20200911_163723.jpg",
            "author": {
                "name": "Akshay Kanthi"
            },
            "tags": [
            ],
            "date_published": "2020-09-13T14:26:44+05:30",
            "date_modified": "2020-09-13T14:35:11+05:30"
        },
        {
            "id": "https://kanthi.io/sassy/",
            "url": "https://kanthi.io/sassy/",
            "title": "SASSY",
            "summary": "Let's say you want to write. You need ink. I've got ink. May I have a bottle, you ask. Not so simple. See ink is messy. You may get your clothes dirty. What if you decide to play Spill the bottle. I have a better&hellip;",
            "content_html": "<p>Let's say you want to write.</p>\n<p>You need ink. I've got ink. <br>May I have a bottle, you ask. </p>\n<p>Not so simple. See ink is messy.<br>You may get your clothes dirty. <br>What if you decide to play<br>Spill the bottle. <br><br>I have a better suggestion<br>You come over to my spot. <br>I've got a nice table, a pot full of ink<br>And plenty of paper too. <br><br>You write to your heart's content <br>Write all you want<br>At the end of the day<br>You leave your paper behind. <br><br>Here I keep them safe<br>In a locker<br>You may visit them anytime. <br>Make any changes<br>Read and trash them too<br><br>While I save a copy<br>Lest you change your mind<br>Just remember to always <br>Leave your paper behind. <br><br>What kind of a perversion is that?<br>That my Lady is <br>Software as a Service. <br><br></p>",
            "image": "https://kanthi.io/media/posts/6/sexy-2339958_1280.jpg",
            "author": {
                "name": "Akshay Kanthi"
            },
            "tags": [
                   "SASS"
            ],
            "date_published": "2020-05-10T00:12:59+05:30",
            "date_modified": "2020-05-10T00:14:44+05:30"
        },
        {
            "id": "https://kanthi.io/freecodecamp-offline/",
            "url": "https://kanthi.io/freecodecamp-offline/",
            "title": "FreeCodeCamp Offline ",
            "summary": "We're running a program called propel.school which is a 2 week free program to get started with learning how to code. 2 weeks is a very short duration to be able to turn you into a coder but it's a start. Our goal from the&hellip;",
            "content_html": "<p>We're running a program called <a href=\"https://propel.school\" target=\"_blank\" rel=\"noopener noreferrer\">propel.school</a> which is a 2 week free program to get started with learning how to code. 2 weeks is a very short duration to be able to turn you into a coder but it's a start. Our goal from the program is to give you a <em>taste </em>for programming and give you exposure on next steps for learning web development and how to start applying for jobs. </p>\n<p>One of the main tasks that people do during the 2 weeks is work towards getting their <a href=\"https://www.freecodecamp.org/learn/\" target=\"_blank\" rel=\"noopener noreferrer\">Basic Data Stucture and Algorithms Certification on FreeCodeCamp</a>. Recently one of our mentors told me that the FreeCodeCamp website was down. That they were upgrading their curriculum and it would probably take 2 days to be able to bring it back up. Something about that statement was weird. Although I was excited about a new project based curriclum 2 days seemed like an awful long time for the transition.</p>\n<p>On closer look I found out <a href=\"https://www.freecodecamp.org/news/freecodecamp-servers-update-october-2019/\" target=\"_blank\" rel=\"noopener noreferrer\">what the heck was going on FreeCodeCamp servers</a>. It was heartening the extraordinary level of commitment when Quincy assures us that FCC will never go down. Even if it means </p>\n<blockquote>\n<p> I would go get some other job and pay for the servers myself.</p>\n<p>- Quincy Larson</p>\n</blockquote>\n<p>This makes me wonder if FreeCodeCamp has to be a web based service that needs to be accessed from the same central servers. Can FreeCodeCamp be hosted on something like <a href=\"https://ipfs.io\" target=\"_blank\" rel=\"noopener noreferrer\">IPFS</a>? While we think on how we can make FreeCodeCamp work offline there is a different interpretation for offline FCC that I am excited about. </p>\n<p>A dedicated physical <em>offline </em>space for people to come and work on FreeCodeCamp and learn programming. That's what <a href=\"https://propel.school\" target=\"_blank\" rel=\"noopener noreferrer\">propel.school</a> is all about. We're looking to start a dedicated space for this. </p>\n<p>More updates soon... </p>\n<p> </p>\n<p> </p>",
            "image": "https://kanthi.io/media/posts/4/offline-online.jpeg",
            "author": {
                "name": "Akshay Kanthi"
            },
            "tags": [
            ],
            "date_published": "2019-10-29T13:02:36+05:30",
            "date_modified": "2019-10-29T13:38:04+05:30"
        }
    ]
}
